<?php

// Услови на задачата: 
//Напишете php програмка, която извежда факториела на  5, 8 и 10.

// Създаваме променлива, в която да запазваме сумата от числата.
$sumOf5 =0;
//Създаваме цикъл, който да изкара факториела на чслото 5.
for ($i =1; $i <=5; $i++){
   // Запазваме сумата на числата в променливата.
   $sumOf5 +=$i;
}
//Принтираме факториела на числто 5.
   echo 'Factorial of 5 is => ' . $sumOf5, '<br >';

 // Създаваме променлива, в която да запазваме сумата от числата.
$sumOf8 =0;
//Създаваме цикъл, който да изкара факториела на чслото 8.
for ($i =1; $i <=8; $i++){
   // Запазваме сумата на числата в променливата.
   $sumOf8 +=$i;
}
//Принтираме факториела на числто 8.
   echo 'Factorial of 8 is => ' . $sumOf8, '<br >';
   
// Създаваме променлива, в която да запазваме сумата от числата.
$sumOf10 =0;
//Създаваме цикъл, който да изкара факториела на чслото 10.
for ($i =1; $i <=10; $i++){
   // Запазваме сумата на числата в променливата.
   $sumOf10 +=$i;
}
//Принтираме факториела на числто 10.
   echo 'Factorial of 10 is => ' . $sumOf10 ;